FKDD_COPY_DIFF_3_2026-02-13/Documents/ВводОстатковАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводОстатковАвтомобилей</Name>
			<Comment>Ввод остатков автомобилей</Comment>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАвтомобилей</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
				<xr:Item>AccumulationRegister.АвтомобилиОтданные</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровОтданные</xr:Item>
				<xr:Item>AccumulationRegister.КомплектацияАвтомобилей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентированныйУчет</Name>
					<Comment>Флаг отражения документа в регламентированном учете</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор, по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект, под который выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен для розничного склада</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыУпр</Name>
					<Comment>Курс валюты управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОприходованияТМЦ</Name>
					<Comment>Статья оприходования ТМЦ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
					<Comment>Перечень автомобилей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Comment>Автомобиль, вводимый как остаток</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторАвтомобиля</Name>
							<Comment>Идентификатор строки автомобиля</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество объектов справочника</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Себестоимость в валюте документа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГТД</Name>
							<Comment>Номер грузовой таможенной декларации (для товаров поступивших по импорту)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтомобильБУ</Name>
							<Comment>Покупаем подержанный автомобиль</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Опции</Name>
					<Comment>Дополнительные опции</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторАвтомобиля</Name>
							<Comment>Идентификатор строки автомобиля</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Comment>Дополнительная опция</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Опции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена позиции дополнительного оборудования</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/ДоходыИРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДоходыИРасходы</Name>
			<Comment>Блок учета доходов и расходов</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоходУпр</Name>
					<Comment>Сумма дохода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходУпр</Name>
					<Comment>Сумма расхода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоходУпрБезНДС</Name>
					<Comment>Сумма дохода в управленческой валюте без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходУпрБезНДС</Name>
					<Comment>Сумма расхода в управленческой валюте без НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРаспределения</Name>
					<Comment>Статья прибылей и убытков, с которой произошло распределение суммы дохода\расхода при выполнении закрытия периода</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходовИРасходов</Name>
					<Comment>Статья доходов и расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/СпособВеденияБаланса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособВеденияБаланса</Name>
			<Comment>Способ ведения баланса</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоКомпании</Name>
					<Comment>По компании в целом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрганизации</Name>
					<Comment>В пределах организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПодразделению</Name>
					<Comment>В пределах подразделения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/ВидАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидАвтомобиля</Name>
			<Comment>Вид автомобиля</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
					<Comment>Новый автомобиль</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтомобильСПробегом</Name>
					<Comment>Автомобиль с пробегом</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/ВводОстатковАвтомобилей/Ext/ObjectModule.bsl
// Модуль документа ВводОстатковАвтомобилей

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

Перем ТекущаяВалютаДокумента Экспорт; // Текущая валюта документа
Перем ТекущийКурсДокумента Экспорт;   // текущий курс валюты документа

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	// Обязательные поля таблицы товаров
	ОбязательныеАвтомобили=Новый Структура();
	ОбязательныеАвтомобили.Вставить("Автомобиль",3);
	ОбязательныеАвтомобили.Вставить("ИдентификаторАвтомобиля",1);
	ОбязательныеАвтомобили.Вставить("Количество",1);
	ОбязательныеОпции=Новый Структура();
	ОбязательныеОпции.Вставить("ИдентификаторАвтомобиля",3);
	ОбязательныеОпции.Вставить("Опция",3);
	ОбязательныеОпции.Вставить("Количество",1);
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	Если ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию ИЛИ
		 ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
		ОбязательныеРеквизиты.Вставить("Контрагент",1);
		ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
	КонецЕсли;
	Если ХозОперация<>Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
		ОбязательныеРеквизиты.Вставить("СкладКомпании",1);
	КонецЕсли;
	ОбязательныеРеквизиты.Вставить("Автомобили",ОбязательныеАвтомобили);
	ОбязательныеРеквизиты.Вставить("Опции",ОбязательныеОпции);
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов документа.
	// Такую проверку необходимо осуществлять, если баланс в системе ведется по организации,
	// или если установлен способ контроля корректности
	// договора и склада документа. Причем, если способ контроля выбран "Контроль по организации и подразделению", то
	// дополнительно осуществляется проверка соответствия подразделений.
	Если Результат Тогда
		СпособКонтроляКорректности = обПраво("КонтрольКорректностиДоговораИСкладаДокумента",Права,,ЭтотОбъект);	
		КонтрольОтсутствует        = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует);
		БалансВедетсяПоОрганизации = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоОрганизации);

		Если БалансВедетсяПоОрганизации ИЛИ НЕ КонтрольОтсутствует Тогда
			КонтрольПоПодразделению = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
			
			КонтролируемыеРеквизиты = Новый Структура();
			
			КонтролируемыеРеквизитыШапки = Новый Структура();
			Если НЕ ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
				КонтролируемыеРеквизитыШапки.Вставить("СкладКомпании", КонтрольПоПодразделению);
			КонецЕсли;	
			Если ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию ИЛИ
				ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию Тогда
				КонтролируемыеРеквизитыШапки.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
			КонецЕсли;
			КонтролируемыеРеквизиты.Вставить("КонтролируемыеРеквизитыШапки",КонтролируемыеРеквизитыШапки);		
			   							
			Результат = дкПроверитьКорректностьПоОрганизации(ЭтотОбъект,КонтролируемыеРеквизиты,Ошибки) И Результат;
		КонецЕсли;  		
	КонецЕсли;
	
	Результат = дкПроверитьКорректностьТоваровКомиссионныхДокументов(ЭтотОбъект,Ошибки,"Автомобили", "Автомобиль", Ложь) И Результат;
	дкПроверитьКорректностьРНПТ(ЭтотОбъект, "Автомобили", "Автомобиль");
	
	Возврат Результат;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: СписокЗначений. 
// Строка списка: Значение - имя предопределенного элемента; 
//				  Представление - красивое его представление
// 				  "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ВводОстатковАвтомобилей","Ввод остатков автомобилей",Истина);
	СписокХозОпераций.Добавить("ВводОстатковАвтомобилейПринятыхНаКомиссию","Ввод остатков автомобилей принятых на комиссию",Ложь);
	СписокХозОпераций.Добавить("ВводОстатковАвтомобилейПереданныхНаКомиссию","Ввод остатков автомобилей переданных на комиссию",Ложь);
	СписокХозОпераций.Добавить("ВводОстатковАвтомобилейНаОтветственномХранении","Ввод остатков автомобилей (ответственное хранение)",Ложь);
	Возврат СписокХозОпераций;
КонецФункции

// функция возвращает список опций для текущего набора модели или варианта комплектации
Функция ПолучитьСписокДоступныхОпций(Модель, ВариантКомплектации = Неопределено) Экспорт
	СписокОборудования=Новый СписокЗначений;
	Запрос = Новый Запрос;
	Если обЗначениеНеЗаполнено(ВариантКомплектации) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	МоделиОпции.Опция КАК Опция
		|ИЗ
		|	Справочник.Модели.Опции КАК МоделиОпции
		|ГДЕ
		|	МоделиОпции.Ссылка = &Модель";
		Запрос.УстановитьПараметр("Модель", Модель);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ОпцииВариантовКомплектации.Опция КАК Опция
		|ИЗ
		|	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
		|ГДЕ
		|	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
		|	И ОпцииВариантовКомплектации.ВидВключения = 1
		|";
		Запрос.УстановитьПараметр("ВариантКомплектации",ВариантКомплектации);
	КонецЕсли;
	СписокОборудования.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Опция"));
	Возврат СписокОборудования
КонецФункции

// Расчет суммы документа
Функция РассчитатьСуммуВсего() Экспорт
	Возврат Автомобили.Итог("СуммаВсего")+Опции.Итог("СуммаВсего");
КонецФункции

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка			– Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма				– Ссылка на форму документа. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="ВалютаДокумента" Тогда
		Попытка
			ТребуетсяПересчет=ДопПараметры.ТребуетсяПересчет;
		Исключение
			ТребуетсяПересчет=Ложь;
		КонецПопытки; 
		Рез=Истина;
		Если ТребуетсяПересчет И (НЕ обЗначениеНеЗаполнено(ТекущаяВалютаДокумента)) Тогда
			Для Каждого СтрокаТЧ Из Автомобили Цикл
				НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаТЧ.Цена Тогда
					СтрокаТЧ.Цена=НоваяЦена;
					Рез=ОбработкаРеквизита("Автомобили.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли;
			КонецЦикла; 
			Для Каждого СтрокаТЧ Из Опции Цикл
				НоваяЦена=обПересчет(СтрокаТЧ.Цена,ТекущаяВалютаДокумента,ТекущийКурсДокумента,ВалютаДокумента,КурсДокумента);
				Если НоваяЦена<>СтрокаТЧ.Цена Тогда
					СтрокаТЧ.Цена=НоваяЦена;
					Рез=ОбработкаРеквизита("Опции.Цена",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
				КонецЕсли;
			КонецЦикла; 
		КонецЕсли; 
		ТекущаяВалютаДокумента=ВалютаДокумента;
		ТекущийКурсДокумента=КурсДокумента;
		Возврат Рез;
		
	ИначеЕсли Имя="Контрагент" Тогда
		Если ХозОперация = Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию ИЛИ
			 ХозОперация = Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
			//Параметры для подстановки или создания договора контрагента
			Если ДопПараметры=Неопределено Тогда ДопПараметры=Новый Структура; КонецЕсли; 
			Если ХозОперация = Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
				ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СКомиссионером);
			Иначе
				ДопПараметры.Вставить("ВидДоговора",Перечисления.ВидыДоговоров.СКомитентом);
			КонецЕсли;
			ДопПараметры.Вставить("ТипЦенПокупки",ТипЦен);
			ДопПараметры.Вставить("ТипЦенПродажи",Справочники.ТипыЦен.ПустаяСсылка());
		КонецЕсли; 
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Возврат Рез;
	
	ИначеЕсли Имя="СкладКомпании" Тогда
		Если НЕ обЗначениеНеЗаполнено(СкладКомпании) Тогда
			Если СкладКомпании.Розничный Тогда
				#Если Клиент Тогда
				Предупреждение("Выбранный склад: """ + СкладКомпании + """ является розничным!
				|Выберите оптовый склад",10);
				#КонецЕсли
				СкладКомпании = Неопределено;
			КонецЕсли; 
		КонецЕсли; 
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "АВТОМОБИЛИ"
	ИначеЕсли Имя="Автомобили.Автомобиль" Тогда
		
		Если дкПроверитьАвтомобильДляКомиссионныхДокументов(ЭтотОбъект.ХозОперация, ТекСтрока) Тогда
			Возврат Истина;
		КонецЕсли;
		
		//Проставим количество
		Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1 КонецЕсли;
		// Заполним ставку НДС
		Если ЗначениеЗаполнено(ТекСтрока.Автомобиль) Тогда
			ТекСтрока.АвтомобильБУ = (Контрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.Покупатель);
		КонецЕсли;
		Если обЗначениеНеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
			Если НЕ обЗначениеНеЗаполнено(Контрагент) И Контрагент.ОсвобожденОтНДС Тогда
				Запрос=Новый Запрос("
				|ВЫБРАТЬ ПЕРВЫЕ 1 СпрСтавкиНДС.Ссылка КАК СтавкаБезНДС
				|ИЗ Справочник.СтавкиНДС КАК СпрСтавкиНДС
				|ГДЕ СпрСтавкиНДС.Ставка=0");
				РезультатСтавкаБезНДС=Запрос.Выполнить();
				Если РезультатСтавкаБезНДС.Пустой() Тогда
					ТекСтрока.СтавкаНДС=Неопределено;
				Иначе
					ТекСтрока.СтавкаНДС=РезультатСтавкаБезНДС.Выгрузить().Получить(0).СтавкаБезНДС;
				КонецЕсли;
			Иначе
				ТекСтрока.СтавкаНДС=Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
			КонецЕсли;
		КонецЕсли; 
		ТекСтрока.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации",ТекСтрока.Автомобиль,Справочники.ВариантыКомплектации.ПустаяСсылка()),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
		ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		//Попробуем подставить ГТД
		Если обЗначениеНеЗаполнено(ТекСтрока.ГТД) Тогда
			ИндексПредСтроки=Автомобили.Индекс(ТекСтрока)-1;
			Если ИндексПредСтроки>=0 Тогда
				ПредСтрока=Автомобили.Получить(ИндексПредСтроки);
				Если НЕ обЗначениеНеЗаполнено(ПредСтрока.ГТД) Тогда
					ТекСтрока.ГТД=ПредСтрока.ГТД;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
		
		//получим список доступных опций
		Если обЗначениеНеЗаполнено(ТекСтрока.Автомобиль) Тогда
			Модель = Справочники.Модели.ПустаяСсылка();
			Вариант = Неопределено;
		Иначе
			Модель = ТекСтрока.Автомобиль.Модель;
			Вариант = ТекСтрока.Автомобиль.ВариантКомплектации;
		КонецЕсли;
		
		СписокДостОпций = ПолучитьСписокДоступныхОпций(Модель,Вариант);
		//получим опции автомобиля
		МассивОпций = Опции.НайтиСтроки(Новый Структура("ИдентификаторАвтомобиля",ТекСтрока.ИдентификаторАвтомобиля));
		
		//найдем опции для удаления
		МассивДляУдаления = Новый Массив;
		Для Каждого стрОпций Из МассивОпций Цикл
			Если СписокДостОпций.НайтиПоЗначению(стрОпций.Опция) = Неопределено Тогда
				МассивДляУдаления.Добавить(стрОпций);
			КонецЕсли;
		КонецЦикла;
		
		//удаление опций из списка
		Для Каждого стрУдалить Из МассивДляУдаления Цикл
			Опции.Удалить(стрУдалить);
		КонецЦикла;
		Возврат Истина;
	
	ИначеЕсли Имя="Автомобили.Количество" ИЛИ Имя="Автомобили.Цена" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.Сумма" Тогда
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.СуммаВсего" Тогда
		//Получим новую сумму НДС как процент от суммы всего
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС
			ТекСтрока.Сумма=ТекСтрока.СуммаВсего;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен
			ТекСтрока.Сумма=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-ТекСтрока.Сумма;
		КонецЕсли; 
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		Возврат Истина;
		
	ИначеЕсли Имя="Автомобили.СтавкаНДС" Тогда
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Автомобили.СуммаНДС" Тогда
		Возврат Истина;
		
	// ОБРАБОТКА РЕКВИЗИТОВ ТАБЛИЧНОЙ ЧАСТИ "ДОПОЛНИТЕЛЬНЫЕ ОПЦИИ"
	ИначеЕсли Имя="Опции.Опция" Тогда
		СтрокаАвтомобиля=Автомобили.Найти(ТекСтрока.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
		Если СтрокаАвтомобиля=Неопределено Тогда
			//Автомобиль не найден, значит и опций нет
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
				ТекСтрока.Опция=Неопределено;
				Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЕсли;
		Автомобиль=СтрокаАвтомобиля.Автомобиль;
		Если обЗначениеНеЗаполнено(Автомобиль) Тогда
			//Автомобиль не прописан, значит и опций нет
			Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
				ТекСтрока.Опция=Неопределено;
				Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
			КонецЕсли; 
		КонецЕсли;
		НаборОпций=Ложь;
		Если ДопПараметры<>Неопределено Тогда
			Если НЕ ДопПараметры.Свойство("НаборОпций",НаборОпций) Тогда
				НаборОпций=Ложь;
			КонецЕсли; 
		КонецЕсли; 
		Если (НЕ НаборОпций) И (НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция)) Тогда
			Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
				ВариантКомплектации=Автомобиль.ВариантКомплектации;
				Модель=Автомобиль.Модель;
			Иначе
				ВариантКомплектации=Неопределено;
				Модель=Неопределено;
			КонецЕсли; 
			Если НЕ обЗначениеНеЗаполнено(ВариантКомплектации) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
							   |	ОпцииВариантовКомплектации.Опция КАК Опция
							   |ИЗ
							   |	РегистрСведений.ОпцииВариантовКомплектации КАК ОпцииВариантовКомплектации
							   |ГДЕ
							   |	ОпцииВариантовКомплектации.ВариантКомплектации = &ВариантКомплектации
							   |	И ОпцииВариантовКомплектации.Опция = &Опция
							   |	И ОпцииВариантовКомплектации.ВидВключения = 1";
				Запрос.УстановитьПараметр("ВариантКомплектации",ВариантКомплектации);
				Запрос.УстановитьПараметр("Опция",ТекСтрока.Опция);
				Выборка=Запрос.Выполнить().Выбрать();
				Если НЕ Выборка.Следующий() Тогда
					//Такой опции в варианте комплектации нет
					Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
						ТекСтрока.Опция=Неопределено;
						Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
					КонецЕсли; 
				КонецЕсли;
			ИначеЕсли НЕ обЗначениеНеЗаполнено(Модель) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	МоделиОпции.Опция КАК Опция
				               |ИЗ
				               |	Справочник.Модели.Опции КАК МоделиОпции
				               |ГДЕ
				               |	МоделиОпции.Ссылка = &Модель
				               |	И МоделиОпции.Опция = &Опция";
				Запрос.УстановитьПараметр("Модель",Модель);
				Запрос.УстановитьПараметр("Опция",ТекСтрока.Опция);
				Выборка=Запрос.Выполнить().Выбрать();
				Если НЕ Выборка.Следующий() Тогда
					//Такой опции в модели нет
					Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
						ТекСтрока.Опция=Неопределено;
						Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
					КонецЕсли; 
				КонецЕсли;
			Иначе
				Если НЕ обЗначениеНеЗаполнено(ТекСтрока.Опция) Тогда
					ТекСтрока.Опция=Неопределено;
					Возврат ОбработкаРеквизита("Опции.Опция",ТекСтрока,ЭтаФорма,ДопПараметры);
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
		Рез=Истина;
		Если ТекСтрока.Опция.ПризнакНабора Тогда
			// имеем дело с набором, разложим его...
			Набор=ТекСтрока.Опция; КоличествоНабора=ТекСтрока.Количество;
			Если КоличествоНабора=0 Тогда КоличествоНабора=1; КонецЕсли; 
			// удалим строку из табличной части
			Опции.Удалить(ТекСтрока);
			// теперь будем рекурсивно добавлять состав набора
			Если ДопПараметры=Неопределено Тогда
				ДопПараметры=Новый Структура;
			КонецЕсли;
			ДопПараметры.Вставить("НаборОпций",Истина);
			Для Каждого ИзНабора Из Набор.СоставНабора Цикл
				Если ИзНабора.Опция.ПризнакНабора Тогда
					//Вот это да, набор в наборе ... игнорируем
					#Если Клиент Тогда
					Сообщить("В наборе """+СокрЛП(Набор)+""" присутствует набор """+СокрЛП(ИзНабора.Опция)+""". Добавление набора """+СокрЛП(ИзНабора.Опция)+""" отменено.",СтатусСообщения.Внимание);
					#КонецЕсли
				Иначе
					// поищем оборудование из набора в таблице
					МассивСтрок=Опции.НайтиСтроки(Новый Структура("Опция",ИзНабора.Опция));
					Если МассивСтрок.Количество()>0 Тогда
						//Если добавляемое оборудование уже есть в табличной части
						//просто увеличим количество, если его запрашивать не надо
						СтрокаТЧ=МассивСтрок[0];
						СтрокаТЧ.Количество=СтрокаТЧ.Количество+(ИзНабора.Количество*КоличествоНабора);
						Рез=ОбработкаРеквизита("Опции.Количество",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
					Иначе
						СтрокаТЧ=Опции.Добавить();
						СтрокаТЧ.ИдентификаторАвтомобиля=СтрокаАвтомобиля.ИдентификаторАвтомобиля;
						СтрокаТЧ.Опция=ИзНабора.Опция;
						СтрокаТЧ.Количество=ИзНабора.Количество*КоличествоНабора;
						Рез=ОбработкаРеквизита("Опции.Опция",СтрокаТЧ,ЭтаФорма,ДопПараметры) И Рез;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла;
			ДопПараметры.Удалить("НаборОпций");
		Иначе
			//Проставим количество
			Если ТекСтрока.Количество=0 Тогда ТекСтрока.Количество=1 КонецЕсли;
			//Установим ставку НДС
			Если дкПроверитьПринадленостьХозОперации(ЭтотОбъект, "Поступление") Тогда
				ОсвобожденОтНДС	= ЭтотОбъект.Контрагент.ОсвобожденОтНДС ИЛИ
					ЭтотОбъект.Контрагент.ФормаСобственности = Перечисления.ФормыСобственности.ЧастноеЛицо;	
			Иначе
				ОсвобожденОтНДС	= ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;	
			КонецЕсли;
			Если ОсвобожденОтНДС Тогда
				ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
			ИначеЕсли ТипЗнч(ТекСтрока.Опция)=Тип("СправочникСсылка.Опции") Тогда
				ТекСтрока.СтавкаНДС = ТекСтрока.Опция.СтавкаНДС; 
			Иначе
				ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; 
			КонецЕсли;
			СтрокаАвтомобиля=Автомобили.Найти(ТекСтрока.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
			Если СтрокаАвтомобиля=Неопределено Тогда
				Модель=Справочники.Модели.ПустаяСсылка();
				ВариантКомплектации=Справочники.ВариантыКомплектации.ПустаяСсылка();
			Иначе
				Модель=СтрокаАвтомобиля.Автомобиль.Модель;
				ВариантКомплектации=СтрокаАвтомобиля.Автомобиль.ВариантКомплектации;
			КонецЕсли; 
			ТекСтрока.Цена=обПолучитьЦену(ТипЦен,Новый Структура("Автомобиль,ВариантКомплектации,Опция",Модель,ВариантКомплектации,ТекСтрока.Опция),?(Ссылка.Пустая(),Дата,МоментВремени()),,ВалютаДокумента,КурсДокумента);
			Рез=ОбработкаРеквизита("Опции.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		Возврат Рез;
		
	ИначеЕсли Имя="Опции.Количество" Тогда
		Возврат ОбработкаРеквизита("Опции.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Опции.Цена" Тогда
		ТекСтрока.Сумма=ТекСтрока.Цена*ТекСтрока.Количество;
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Опции.Сумма" Тогда
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС - Сумма всего равна сумме
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен - Получим сумму НДС
			ТекСтрока.СуммаНДС=(ТекСтрока.Сумма*ТекСтрока.СтавкаНДС.Ставка)/100;
			ТекСтрока.СуммаВсего=ТекСтрока.Сумма+ТекСтрока.СуммаНДС;
		КонецЕсли;
		Возврат Истина;
		
	ИначеЕсли Имя="Опции.СуммаВсего" Тогда
		ЦенаВключаетНДС=?(обЗначениеНеЗаполнено(ТипЦен),Истина,ТипЦен.ЦенаВключаетНДС);
		Если ЦенаВключаетНДС Тогда
			//Цена уже содержит НДС
			ТекСтрока.Сумма=ТекСтрока.СуммаВсего;
			СуммаБезНДС=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-СуммаБезНДС;
		Иначе
			//НДС в цену не включен
			ТекСтрока.Сумма=(100*ТекСтрока.СуммаВсего)/(100+ТекСтрока.СтавкаНДС.Ставка);
			ТекСтрока.СуммаНДС=ТекСтрока.СуммаВсего-ТекСтрока.Сумма;
		КонецЕсли; 
		ТекСтрока.Цена=ТекСтрока.Сумма/?(ТекСтрока.Количество=0,1,ТекСтрока.Количество);
		Возврат Истина;
		
	ИначеЕсли Имя="Опции.СтавкаНДС" Тогда
		Возврат ОбработкаРеквизита("Автомобили.Цена",ТекСтрока,ЭтаФорма,ДопПараметры);
		
	ИначеЕсли Имя="Опции.СуммаНДС" Тогда
		Возврат Истина;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

// у нас не стандартная таблица, поэтому сформирует свой результат запроса по автомобилям
Функция ПолучитьРезультатЗапросаПоАвтомобилям()
	ДокументОбъектСтруктура=Новый Структура();
	ДокументОбъектСтруктура.Вставить("Ссылка",Ссылка);
	Возврат зфЗащищенныеФункцииСервер.ВводОстатковАвтомобилейПолучитьРезультатЗапросаПоАвтомобилям(ДокументОбъектСтруктура);
КонецФункции

// возвращает выборку по шапке
// ДокументСсылка - Ссылка на документ для которого получаем шапку
Функция ПолучитьШапкуДокумента(ДокументСсылка)
	Запрос=Новый Запрос("
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка,
	|	Док.Дата КАК Дата,
	|	Док.ВалютаДокумента КАК ВалютаДокумента,
	|	Док.КурсДокумента КАК КурсДокумента,
	|	Док.ТипЦен КАК ТипЦен,
	|	Док.ХозОперация КАК ХозОперация,
	|	Док.КурсВалютыУпр КАК КурсВалютыУпр,
	|	Док.МоментВремени КАК МоментВремени,
	|	Док.ПодразделениеКомпании КАК ПодразделениеКомпании,
	/////////// ПРИВАТ ////////////
	|	Док.СкладКомпании КАК СкладКомпании,
	|	Док.Контрагент КАК Контрагент,
	|	Док.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	Док.СтатьяОприходованияТМЦ КАК СтатьяОприходованияТМЦ
	|
	|ИЗ
	|	Документ."+Метаданные().Имя+" КАК Док
	|ГДЕ
	|	Док.Ссылка=&Ссылка
	|");
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Выборка=Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	Возврат Выборка;
КонецФункции

// формирует движения документа по партионным регистрам
// Возвращает Истина - все хорошо, ложь - чего-то не так
Функция ПровестиПоПартиям(Режим,ДокументСсылка) Экспорт
	Отказ=Ложь;

	// Получим способ ведения баланса.
	БалансВедетсяПоПодразделениям = (Константы.СпособВеденияБаланса.Получить()=Перечисления.СпособВеденияБаланса.ПоПодразделению);
	
	// получим шапку документа
	ШапкаДокумента=ПолучитьШапкуДокумента(ДокументСсылка);
	
	//// проверим, если подразделение проводиться по партиям "отложено", то дальше не идем
	//НаборЗаписейДопроведениеПоПартиям=Движения.ДопроведениеПоПартиям;
	//НаборЗаписейДопроведениеПоПартиям.ДокументОбъект=ЭтотОбъект;
	//НаборЗаписейДопроведениеПоПартиям.ШапкаДокумента=ШапкаДокумента;
	//Отказ=НЕ НаборЗаписейДопроведениеПоПартиям.Зафиксировать() ИЛИ Отказ;
	//Если НаборЗаписейДопроведениеПоПартиям.НеПроводитьПартии Тогда
	//	Возврат НЕ Отказ;
	//КонецЕсли;
	
	Если ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилей Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	СУММА(ОбъединенныйЗапрос.СуммаАвтомобилейУпр + ОбъединенныйЗапрос.СуммаОпцийУпр) КАК СуммаУпр
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ЕСТЬNULL(СУММА(ОстаткиАвтомобилей.СуммаУпр), 0) КАК СуммаАвтомобилейУпр,
		             |		0 КАК СуммаОпцийУпр
		             |	ИЗ
		             |		РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		             |	ГДЕ
		             |		ОстаткиАвтомобилей.Регистратор = &Регистратор
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		0,
		             |		ЕСТЬNULL(СУММА(КомплектацияАвтомобилей.СуммаУпр), 0)
		             |	ИЗ
		             |		РегистрНакопления.КомплектацияАвтомобилей КАК КомплектацияАвтомобилей
		             |	ГДЕ
		             |		КомплектацияАвтомобилей.Регистратор = &Регистратор) КАК ОбъединенныйЗапрос";
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			// Доходы и расходы
			НаборЗаписейДиР 						= Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= ШапкаДокумента.СтатьяОприходованияТМЦ;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение		= ШапкаДокумента.СкладКомпании.Подразделение;
			КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.Доход					= Выборка.СуммаУпр;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			Отказ=НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли; 
		
	ИначеЕсли ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	СУММА(ОбъединенныйЗапрос.СуммаАвтомобилейУпр + ОбъединенныйЗапрос.СуммаОпцийУпр) КАК СуммаУпр
		             |ИЗ
		             |	(ВЫБРАТЬ
		             |		ЕСТЬNULL(СУММА(АвтомобилиОтданные.СуммаУпр), 0) КАК СуммаАвтомобилейУпр,
		             |		0 КАК СуммаОпцийУпр
		             |	ИЗ
		             |		РегистрНакопления.АвтомобилиОтданные КАК АвтомобилиОтданные
		             |	ГДЕ
		             |		АвтомобилиОтданные.Регистратор = &Регистратор
		             |	
		             |	ОБЪЕДИНИТЬ ВСЕ
		             |	
		             |	ВЫБРАТЬ
		             |		0,
		             |		ЕСТЬNULL(СУММА(ПартииТоваровОтданные.СуммаУпр), 0)
		             |	ИЗ
		             |		РегистрНакопления.ПартииТоваровОтданные КАК ПартииТоваровОтданные
		             |	ГДЕ
		             |		ПартииТоваровОтданные.Регистратор = &Регистратор) КАК ОбъединенныйЗапрос";
		Запрос.УстановитьПараметр("Регистратор",ШапкаДокумента.Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			// Доходы и расходы
			НаборЗаписейДиР 						= Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект 			= ЭтотОбъект;
			НаборЗаписейДиР.СтатьяДоходовИРасходов	= ШапкаДокумента.СтатьяОприходованияТМЦ;
			Если БалансВедетсяПоПодразделениям Тогда
				НаборЗаписейДиР.Подразделение		= ШапкаДокумента.ДоговорВзаиморасчетов.Подразделение;
			КонецЕсли;
			НаборЗаписейДиР.ВУпрВалюте				= Истина;
			НаборЗаписейДиР.ШапкаДокумента			= ШапкаДокумента;
			НаборЗаписейДиР.Доход					= Выборка.СуммаУпр;
			Отказ=НЕ НаборЗаписейДиР.Приход() ИЛИ Отказ;
		КонецЕсли;

	КонецЕсли;
	
	Возврат НЕ Отказ;
КонецФункции

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

// Формирует печатную форму "Ввод остатков товаров"
// Возвращает сформированный табличный документ:
Функция ПечатьВводОстатковАвтомобилей(ТабДокумент) Экспорт
	Макет = ПолучитьМакет("ВводОстатковАвтомобилей");
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = орПривестиМакетПечатнойФормы(ЭтотОбъект, Макет);
	
	//форматы вывода
	ФорматВыводаКоличества	= обПраво("ФорматВыводаКоличества",Права,,ЭтотОбъект);
	ФорматВыводаСуммы		= обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	
	Если ХозОперация = Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
		ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	Иначе
		ОбластьМакета.Параметры.Организация	= Контрагент;
		ОбластьМакета.Параметры.Контрагент	= Организация;
	КонецЕсли;
    ОбластьМакета.Параметры.ПредставлениеОрганизации = спПолучитьПредставление(ОбластьМакета.Параметры.Организация);
	ОбластьМакета.Параметры.ПредставлениеКонтрагента = спПолучитьПредставление(ОбластьМакета.Параметры.Контрагент);
	
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	//сразу два, т.к. выводим на второй странице только
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	
	//подготовим дополнительную таблицу
	ТаблицаОпцийПоАвтомобилям = ЭтотОбъект.Опции.Выгрузить();
	ТаблицаОпцийПоАвтомобилям.Свернуть("ИдентификаторАвтомобиля","Сумма,СуммаНДС,СуммаВсего");
	
	//перебор строк
	ВыборкаТабличнойЧасти = ЭтотОбъект.Автомобили.Выгрузить();
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//предварительная обработка строки ТЧ
		СтрокаТабличнойЧастиОпции = ТаблицаОпцийПоАвтомобилям.Найти(СтрокаТабличнойЧасти.ИдентификаторАвтомобиля,"ИдентификаторАвтомобиля");
		Если СтрокаТабличнойЧастиОпции <> Неопределено Тогда
			СтрокаТабличнойЧасти.Сумма		= СтрокаТабличнойЧасти.Сумма		+ СтрокаТабличнойЧастиОпции.Сумма;
			СтрокаТабличнойЧасти.СуммаНДС	= СтрокаТабличнойЧасти.СуммаНДС		+ СтрокаТабличнойЧастиОпции.СуммаНДС;
			СтрокаТабличнойЧасти.СуммаВсего	= СтрокаТабличнойЧасти.СуммаВсего	+ СтрокаТабличнойЧастиОпции.СуммаВсего;
		КонецЕсли;
		//заполняем данные строки
		СтруктураСтроки = орПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти,ЭтотОбъект);
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице,ЭтотОбъект);
		
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",ВалютаДокумента,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		//добавляем итоги
		дкДобавитьИтогиПоСтранице(СтрокаТабличнойЧасти,СтруктураИтоговПоСтранице);
	КонецЦикла;

	//довыводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент,ОбластьМакетаИтогоПоСтранице,СтруктураИтоговПоСтранице,ЭтотОбъект);
	КонецЕсли;
	
	//итоги
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ВалютаДокумента = ВалютаДокумента;
	СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
	ОбластьМакета.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
	ОбластьМакета.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
	ОбластьМакета.Параметры.СуммаПрописью = "Всего наименований "+ВыборкаТабличнойЧасти.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего,ЭтотОбъект.ВалютаДокумента);
	
	// Выводим представления и расшифровки подписей
	Отпустил = дкОтветственноеЛицо(ЭтотОбъект,"Отпустил");
	Отпустил.ОтпустилПредставление = ?(обЗначениеНеЗаполнено(Отпустил.Отпустил),"","/ "+ Отпустил.ОтпустилПредставление);
	ОбластьМакета.Параметры.Заполнить(Отпустил);
	Получил  = дкОтветственноеЛицо(ЭтотОбъект,"Получил");
	Получил.ПолучилПредставление = ?(обЗначениеНеЗаполнено(Получил.Получил),"","/ "+ Получил.ПолучилПредставление);
	ОбластьМакета.Параметры.Заполнить(Получил);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
// Параметры: НазваниеМакета - строка, название макета, если пусто - то по умолчанию,
//   Документ - сюда можно передать уже созданный табличный документ для заполнения
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=1, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	// Вызов конкретно печатной формы и печать результата прописано в общем модуле
	// здесь могут быть вставлены дополнительные механизмы
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	ТекущаяВалютаДокумента=ВалютаДокумента;
	ТекущийКурсДокумента=КурсДокумента;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	Если (ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию) И 
		 (НЕ обЗначениеНеЗаполнено(СкладКомпании)) Тогда
		 СкладКомпании=Неопределено;
	КонецЕсли; 
	
	//Проверим корректность склада
	Если НЕ Отказ Тогда
		Если НЕ обЗначениеНеЗаполнено(СкладКомпании) Тогда
			Если СкладКомпании.Розничный Тогда
				#Если Клиент Тогда
				Предупреждение("Выбранный склад: """ + СкладКомпании + """ является розничным!
				|Выберите оптовый склад",10);
				#КонецЕсли
				Отказ=Истина; Возврат;
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 	
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// автомобили
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ СкладКомпании ИЗ РегистрНакопления.ОстаткиАвтомобилей ГДЕ Регистратор=&Ссылка";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("АвтомобильСкладКомпанииБыл", Результат.Выгрузить().ВыгрузитьКолонку("СкладКомпании"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	Если (Не Отказ) И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		//Проверим VIN автомобилей
		Для Каждого СтрокаАвтомобиля Из Автомобили Цикл
			Если СтрокаАвтомобиля.АвтомобильБУ Тогда
				Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Перечисления.ВидАвтомобиля.АвтомобильСПробегом, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
			Иначе
				Справочники.Автомобили.ЗаписьЗначенияРегистраСведения(СтрокаАвтомобиля.Автомобиль, Перечисления.ВидАвтомобиля.Новый, Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля, Дата);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
	
	//проверим, что автомобиль отсутствует на остатках по различным регистрам
	Если НЕ РегистрыНакопления.ОстаткиАвтомобилей.ПроверитьОстаткиАвтомобилей(ЭтотОбъект,Отказ) Тогда 
		дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);		
		Возврат; 
	КонецЕсли;

	Если ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилей ИЛИ
		 ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию ИЛИ
		 ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейНаОтветственномХранении Тогда
		// у нас не стандартная таблица, поэтому сформирует свой результат запроса по автомобилям
		РезультатЗапросаПоАвтомобилям=ПолучитьРезультатЗапросаПоАвтомобилям();
		
		// Приходуем автомобили
		НаборЗаписейОстатки=Движения.ОстаткиАвтомобилей;
		НаборЗаписейОстатки.РежимПроведения=Режим;
		НаборЗаписейОстатки.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейОстатки.РезультатЗапросаПоАвтомобилям=РезультатЗапросаПоАвтомобилям;
		НаборЗаписейОстатки.СкладКомпании=СкладКомпании;
		Если ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию Тогда
			НаборЗаписейОстатки.СтатусПартии=Перечисления.СтатусыПартий.ТоварПринятыйКомиссия;
		ИначеЕсли ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейНаОтветственномХранении Тогда
			НаборЗаписейОстатки.СтатусПартии=Перечисления.СтатусыПартий.ТоварОтветственноеХранение;
		Иначе
			НаборЗаписейОстатки.СтатусПартии=Перечисления.СтатусыПартий.ТоварКупленный;
		КонецЕсли; 
		НаборЗаписейОстатки.Партия=Ссылка;
		Отказ=НЕ НаборЗаписейОстатки.Приход() ИЛИ Отказ;
		
		
		Если НЕ Отказ Тогда
			//Запишем комплектацию автомобилей
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
						 |	ВводОстатковАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
						 |	ВводОстатковАвтомобилейОпции.Опция КАК Номенклатура,
						 |	NULL КАК ХарактеристикаНоменклатуры,
						 |	&СтатусПартии КАК СтатусПартии,
						 |	ВводОстатковАвтомобилейОпции.Ссылка КАК Партия,
						 |	ВводОстатковАвтомобилейАвтомобили.ГТД КАК ГТД,
						 |	ВводОстатковАвтомобилейОпции.СтавкаНДС КАК СтавкаНДС,
						 |	ВводОстатковАвтомобилейОпции.Количество КАК Количество,
						 |	ВводОстатковАвтомобилейОпции.СуммаВсего КАК Сумма,
						 |	ВводОстатковАвтомобилейОпции.СуммаВсего КАК СуммаУпр,
						 |	ВводОстатковАвтомобилейОпции.СуммаНДС КАК СуммаНДС
						 |ИЗ
						 |	Документ.ВводОстатковАвтомобилей.Опции КАК ВводОстатковАвтомобилейОпции
						 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковАвтомобилей.Автомобили КАК ВводОстатковАвтомобилейАвтомобили
						 |		ПО ВводОстатковАвтомобилейОпции.Ссылка = ВводОстатковАвтомобилейАвтомобили.Ссылка
						 |			И ВводОстатковАвтомобилейОпции.ИдентификаторАвтомобиля = ВводОстатковАвтомобилейАвтомобили.ИдентификаторАвтомобиля
						 |ГДЕ
						 |	ВводОстатковАвтомобилейОпции.Ссылка = &Ссылка";
			Если ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию Тогда
				Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварПринятыйКомиссия);
			ИначеЕсли ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейНаОтветственномХранении Тогда
				Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварОтветственноеХранение);
			Иначе
				Запрос.УстановитьПараметр("СтатусПартии",Перечисления.СтатусыПартий.ТоварКупленный);
			КонецЕсли;
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			ТаблицаОпций=Запрос.Выполнить().Выгрузить();
			ВалютаРегл=Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
			Если ВалютаДокумента<>ВалютаРегл Тогда
				Для Каждого СтрокаОпций Из ТаблицаОпций Цикл
					СтрокаОпций.Сумма=обПересчет(СтрокаОпций.Сумма,ВалютаДокумента,Дата,ВалютаРегл,Дата);
					СтрокаОпций.СуммаНДС=обПересчет(СтрокаОпций.СуммаНДС,ВалютаДокумента,Дата,ВалютаРегл,Дата);
				КонецЦикла; 
			КонецЕсли; 
			ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
			Если обЗначениеНеЗаполнено(КурсВалютыУпр) Тогда
				СтруктураКурса = обКурсДляВалюты(ВалютаУпр,МоментВремени());
				КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
			Иначе
				КурсУпр        = КурсВалютыУпр;
			КонецЕсли;
			Если ВалютаДокумента<>ВалютаУпр Тогда
				Для Каждого СтрокаОпций Из ТаблицаОпций Цикл
					СтрокаОпций.СуммаУпр=обПересчет(СтрокаОпций.СуммаУпр,ВалютаДокумента,Дата,ВалютаУпр,КурсУпр);
				КонецЦикла; 
			КонецЕсли; 
			НаборЗаписейКомплектацияАвтомобилей=Движения.КомплектацияАвтомобилей;
			НаборЗаписейКомплектацияАвтомобилей.РежимПроведения=Режим;
			НаборЗаписейКомплектацияАвтомобилей.ДокументОбъект=ЭтотОбъект;
			НаборЗаписейКомплектацияАвтомобилей.РезультатЗапросаПоТоварам=ТаблицаОпций;
			НаборЗаписейКомплектацияАвтомобилей.СкладКомпании=СкладКомпании;
			НаборЗаписейКомплектацияАвтомобилей.ШапкаДокумента=ПолучитьШапкуДокумента(Ссылка);
			Отказ=НЕ НаборЗаписейКомплектацияАвтомобилей.Приход() ИЛИ Отказ;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			НаборЗаписейОстатки.Записать();
			НаборЗаписейКомплектацияАвтомобилей.Записать();
		КонецЕсли; 
		
	ИначеЕсли ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПереданныхНаКомиссию Тогда
		// Отдаем товар на комиссию
		Запрос=Новый Запрос("
			|ВЫБРАТЬ
			|	ВводОстатковАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
			|	ВводОстатковАвтомобилейАвтомобили.ГТД КАК ГТД,
			|	&Ссылка КАК Партия,
			|	Сумма(ВводОстатковАвтомобилейАвтомобили.СуммаНДС) КАК СуммаНДС,
			|	Сумма(ВводОстатковАвтомобилейАвтомобили.Сумма) КАК Сумма,
			|	Сумма(ВводОстатковАвтомобилейАвтомобили.СуммаВсего) КАК СуммаВсего,
			|	Сумма(ВводОстатковАвтомобилейАвтомобили.Количество) КАК Количество
			|ИЗ
			|	Документ.ВводОстатковАвтомобилей.Автомобили КАК ВводОстатковАвтомобилейАвтомобили
			|ГДЕ
			|	ВводОстатковАвтомобилейАвтомобили.Ссылка=&Ссылка
			|СГРУППИРОВАТЬ ПО Автомобиль,ГТД");
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		//Проведем по регистру отданных на реализацию автомобилей
		НаборЗаписейАвтомобилиОтданные=Движения.АвтомобилиОтданные;
		НаборЗаписейАвтомобилиОтданные.ДокументОбъект=ЭтотОбъект;
		НаборЗаписейАвтомобилиОтданные.Контрагент=Контрагент;
		НаборЗаписейАвтомобилиОтданные.ДоговорВзаиморасчетов=ДоговорВзаиморасчетов;
		НаборЗаписейАвтомобилиОтданные.РезультатЗапросаПоАвтомобилям=Запрос.Выполнить();
		НаборЗаписейАвтомобилиОтданные.ПередаватьНаКомиссиюВсеАвтомобили=Истина;
		Отказ=НЕ НаборЗаписейАвтомобилиОтданные.Приход();

		//А теперь оборудование производителя оприходуем на "Партии товаров отданные"
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
				|	ВводОстатковАвтомобилейАвтомобили.Автомобиль КАК Автомобиль,
				|	ВводОстатковАвтомобилейОпции.Опция КАК Номенклатура,
				|	ВводОстатковАвтомобилейАвтомобили.ГТД КАК ГТД,
				|	ВводОстатковАвтомобилейОпции.Количество КАК Количество,
				|	ВводОстатковАвтомобилейОпции.СуммаВсего КАК Сумма,
				|	ВводОстатковАвтомобилейОпции.СуммаВсего КАК СуммаУпр,
				|	ВводОстатковАвтомобилейОпции.СуммаНДС КАК СуммаНДС
				|ИЗ
				|	Документ.ВводОстатковАвтомобилей.Опции КАК ВводОстатковАвтомобилейОпции
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
				|	Документ.ВводОстатковАвтомобилей.Автомобили КАК ВводОстатковАвтомобилейАвтомобили
				|ПО
				|	ВводОстатковАвтомобилейОпции.Ссылка = &Ссылка И 
				|	ВводОстатковАвтомобилейОпции.Ссылка = ВводОстатковАвтомобилейАвтомобили.Ссылка И 
				|	ВводОстатковАвтомобилейОпции.ИдентификаторАвтомобиля = ВводОстатковАвтомобилейАвтомобили.ИдентификаторАвтомобиля
				|ГДЕ
				|	ВводОстатковАвтомобилейОпции.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		ТаблицаОпций = Запрос.Выполнить().Выгрузить();
		ВалютаРегл = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		
		ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
		Если обЗначениеНеЗаполнено(КурсВалютыУпр) Тогда
			СтруктураКурса = обКурсДляВалюты(ВалютаУпр,МоментВремени());
			КурсУпр		   = СтруктураКурса.Курс / ?(СтруктураКурса.Кратность = 0, 1, СтруктураКурса.Кратность);
		Иначе
			КурсУпр        = КурсВалютыУпр;
		КонецЕсли;
		
		ОпцияПроизводителя   = Справочники.Номенклатура.ОпцияПроизводителя;
		ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		НаборЗаписейПартииОтданные = Движения.ПартииТоваровОтданные;
		Для Каждого СтрокаОпций Из ТаблицаОпций Цикл
			
			Если ВалютаДокумента<>ВалютаРегл Тогда
				СтрокаОпций.Сумма    = обПересчет(СтрокаОпций.Сумма, ВалютаДокумента, Дата, ВалютаРегл, Дата);
				СтрокаОпций.СуммаНДС = обПересчет(СтрокаОпций.СуммаНДС, ВалютаДокумента, Дата, ВалютаРегл, Дата);
			КонецЕсли;
			
			Если ВалютаДокумента<>ВалютаУпр Тогда
				СтрокаОпций.СуммаУпр = обПересчет(СтрокаОпций.СуммаУпр, ВалютаДокумента, Дата, ВалютаУпр, КурсУпр);
			КонецЕсли;
			
			НоваяЗапись = НаборЗаписейПартииОтданные.Добавить();
			НоваяЗапись.ВидДвижения                = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период                     = Дата;
			НоваяЗапись.Регистратор                = Ссылка;
			НоваяЗапись.ДокументПередачи           = Ссылка;
			НоваяЗапись.Партия                     = Ссылка;
			НоваяЗапись.Контрагент                 = Контрагент;
			НоваяЗапись.ДоговорВзаиморасчетов      = ДоговорВзаиморасчетов;
			НоваяЗапись.Автомобиль                 = СтрокаОпций.Автомобиль;
			НоваяЗапись.Номенклатура               = ОпцияПроизводителя;
			НоваяЗапись.ХарактеристикаНоменклатуры = ПустаяХарактеристика;
			НоваяЗапись.ГТД                        = СтрокаОпций.ГТД;
			НоваяЗапись.ХозОперация                = ХозОперация;
			НоваяЗапись.Количество                 = СтрокаОпций.Количество;
			НоваяЗапись.Сумма                      = СтрокаОпций.Сумма;
			НоваяЗапись.СуммаУпр                   = СтрокаОпций.СуммаУпр;
			НоваяЗапись.СуммаНДС                   = СтрокаОпций.СуммаНДС;
			НоваяЗапись.СуммаСебестоимостиУпр      = СтрокаОпций.СуммаУпр;
			НоваяЗапись.СуммаСебестоимостиРегл     = СтрокаОпций.Сумма;
		КонецЦикла; 
		
		Если НЕ Отказ Тогда
			НаборЗаписейАвтомобилиОтданные.Записать();
			НаборЗаписейПартииОтданные.Записать();
		КонецЕсли; 
		
	КонецЕсли;
	
	// проведем партии товаров
	Отказ=НЕ ПровестиПоПартиям(Режим,Ссылка) ИЛИ Отказ;
	
	ДвигаемГраницу = ((ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилей ИЛИ
	ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейПринятыхНаКомиссию ИЛИ
	ХозОперация=Справочники.ХозОперации.ВводОстатковАвтомобилейНаОтветственномХранении) И
	Режим<>РежимПроведенияДокумента.Оперативный);
	Если ДвигаемГраницу ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.АвтомобильСкладКомпанииБыл) Тогда
		// двигаем границу последовательности автомобилей
		НаборЗаписейГраницыАвтомобили = РегистрыСведений.ГраницыАвтомобили.СоздатьНаборЗаписей();
		Если ДвигаемГраницу Тогда
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= СкладКомпании;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= Дата;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыАвтомобили.СкладКомпании		= ДополнительныеСвойства.АвтомобильСкладКомпанииБыл;
			НаборЗаписейГраницыАвтомобили.МоментВремени		= ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыАвтомобили.СкладКомпанииБыл	= Неопределено;
			НаборЗаписейГраницыАвтомобили.МоментВремениБыл	= Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыАвтомобили.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыАвтомобили.ИзменитьГраницу();
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
КонецПроцедуры // ОбработкаПроведения

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
